### Jonathan Dyer
### jbdyer

Setup for data loading

In [2]:
UseGitHub = True
if UseGitHub:
    prefix = 'https://raw.githubusercontent.com/ProfRaja/67364/master/data/a2/'
else:
    prefix = '' # load locally
    
expeditions_xls = prefix+'Expeditions.xls'
titles_csv = prefix+'titles.csv'
cast_csv = prefix+'cast_4_1960.csv'
release_dates_csv = prefix+'release_dates.csv'

Create a pivot table with Pandas that displays the contents of Expeditions.xls

In [3]:
import pandas as pd

cols_to_use = ['WHERE', 'HOW', 'REVENUE'] # column names we care about

# read excel sheet into data frame, keeping only the columns we want
data = pd.read_excel(expeditions_xls, usecols=cols_to_use)
data.head()

    WHERE      HOW  REVENUE
0   Paris    Store       80
1  London  Catalog     1794
2   Paris    Store       16
3  London    Store      885
4   Paris    Store      165

In order to get totals of each row and column, just use the pivot table margins!

In [4]:
pvt = data.pivot_table(index='WHERE',
                      columns='HOW',
                      values='REVENUE',
                      aggfunc='sum',
                      margins=True,
                      margins_name='Total')

pvt

HOW       Catalog   Store    Web   Total
WHERE
London      50310  151015  13009  214334
New York     8712   28060   2351   39123
Paris       32166  104083   7054  143303
Sydney       5471   21769   2749   29989
Tokyo       12103   42610   2003   56716
Total      108762  347537  27166  483465